app/controllers/site_controller.rb

INSERT INTO "phones" ("number", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["number", "4026608760"], ["created_at", "2016-11-09 18:57:00.958285"], ["updated_at", "2016-11-09 18:57:00.958285"]]
---
  def create
  phone = Phone.format_number(phone_params)
  @saved_number = Phone.new(number:phone)


	if @saved_number.save

SELECT  "daily_specials".* FROM "daily_specials"  ORDER BY "daily_specials"."id" DESC LIMIT 1
---
  def send_blast
  	@new_blast = Blast.create
    @blast_info = DailySpecial.last